# HasSizeTable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..HasSizeTable Method
FamilySizeTableManager Class See Also
---
Checks if a FamilySizeTable of a given name exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasSizeTable(
	string tableName
)
```

Visual Basic
---
```text
Public Function HasSizeTable ( _
	tableName As String _
) As Boolean
```

Visual C++
---
```text
public:
bool HasSizeTable(
	String^ tableName
)
```

# ### Parameters
tableName
    Type: System..::..String The name of the FamilySizeTable.
# ### Return Value
True if the FamilySizeTable exists, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace